{"id": 10001, "context": "We are reporting a 14 year old male patient of an Ethiopian ethnicity who had been transferred from private clinic 3 months ago with a compliant of progressively increased weight gain since child hood. At birth, he weighed 5 kg, and at 6 weeks old that weight had gradually increased to 8 kg. After his 4th year of age, the weight gain progression became worse. He had increased appetite to food since childhood and favored eating sugar-containing foods. He had a history of acting aggressively, which is followed by irrational rage and emotional outbursts when the size of a meal is reduced or restricted. He is currently in grade 7. There was no family history of obesity, diabetes mellitus, hypertension, or other chronic illnesses, except for his overweight mother, who had a body mass index (BMI) of 29kg/m2. His vital signs were all in normal range. He had a weight of 160 kg and a height of 157 cm, making his BMI 65 kg/m2, which is class III obesity. He had narrow nasal bridge and thin vermilion of the upper lip with down-turned corners of the mouth. There were dry, dark patches on the skin of the neck and armpit, and there was no hair growth at the armpit or pubic area. He had no secondary sexual characteristics (Tanner stage 1). He had a micro penis and poorly rugated scrotal skin with a small testicle of 1–2 ml size by orchidometer measurement. Basic laboratory tests, including complete blood count, renal function test, liver enzymes, serum bilirubin, serum albumin, and serum electrolytes, were all normal. Ophthalmological evaluation showed refractive error corrected with eyeglasses; he otherwise had a normal retinal exam. Abdominal ultrasound imaging was normal except for nonspecific hepatomegaly of 18 cm with homogenous echo pattern and smooth contour. Brain magnetic resonance imaging (MRI) was unremarkable except for partial empty sella. Genetic testing showed an aberrant methylation pattern on 15q11-13 region.", "disease": "Prader-Willi syndrome", "orphacode": "ORPHA:739"}
{"id": 10002, "context": "Chief complaint:\nProgressive excessive weight gain since childhood, with worsening hyperphagia and behavioral dysregulation related to food restriction.\n﻿\nHistory of present illness:\nA 14-year-old male with lifelong weight gain and feeding abnormalities. Birth weight was 5 kg, with rapid increase to 8 kg by 6 weeks. Caregivers recall decreased muscle tone and poor feeding coordination during infancy, followed by a transition to marked hyperphagia and food-seeking behaviors in early childhood. Since age 4, progressive obesity associated with insatiable appetite, strong craving for high-carbohydrate and sugar-containing foods, and episodes of food sneaking. Behavioral disturbances include irritability, temper outbursts, and poorly controlled emotional reactions when food intake is limited. Learning difficulties and mild cognitive delays have been noted, although he is able to attend regular school (currently grade 7). Sleep-related issues such as excessive daytime sleepiness and unrefreshing sleep have intermittently occurred. No history of seizures. No symptoms suggestive of diabetes, hypertension, or chronic systemic diseases.\n﻿\nFamily history:\nNo known history of early-onset obesity, diabetes mellitus, hypertension, or hereditary endocrine or metabolic disorders. Mother is overweight (BMI 29 kg/m²). No family history of developmental delay or behavioral disorders.\n﻿\nPhysical examination:\nHeight 157 cm, weight 160 kg, BMI 65 kg/m² (class III obesity). Body habitus marked by generalized adiposity, central fat accumulation, and reduced lean muscle mass. Facial features include narrow nasal bridge, almond-shaped eyes, and thin upper lip with downturned corners of the mouth. Skin exam notable for dry, hyperpigmented patches over neck and axillae suggestive of insulin resistance. Hypotonia and reduced muscle bulk observed in upper and lower limbs. Absence of axillary or pubic hair; no secondary sexual characteristics (Tanner stage 1). Genital exam reveals micropenis, small testes (1–2 mL), and poorly rugated scrotal skin. Mild scoliosis suspected on postural assessment.\n﻿\nSpecialty assessments:\nEndocrinology evaluation indicates hypogonadism with absent pubertal development and features consistent with global pituitary hormone dysregulation. Behavioral medicine assessment notes impulsivity, food-seeking behavior, and emotional lability. Ophthalmologic evaluation reveals correctable refractive error; fundoscopic exam normal. Neurological assessment shows mild hypotonia but no focal deficits. Developmental assessment suggests borderline cognitive functioning and mild learning difficulties.\n﻿\nAncillary investigation:\nBasic laboratory tests (CBC, renal function, liver enzymes, bilirubin, albumin, electrolytes) within normal range. Fasting glucose and HbA1c currently normal despite severe obesity. Thyroid function mildly low-normal; morning cortisol low-normal. Lipid panel reveals borderline elevated triglycerides. Abdominal ultrasound shows hepatomegaly (18 cm) with homogeneous echotexture. Brain MRI demonstrates partial empty sella, consistent with possible pituitary hypofunction. Genetic testing reveals an abnormal methylation pattern in the 15q11–13 region. Polysomnography recommended due to daytime somnolence and obesity-related risk for sleep-disordered breathing.", "disease": "Kimura's Disease", "orphacode": "ORPHA:482"}
{"id": 10003, "context": "Chief Complaint\nA pediatric patient presenting with short stature and progressive joint stiffness.\n\nHistory of Present Illness\nThe patient has a history of proportionate short stature noted since early childhood, accompanied by progressively apparent shortening of the hands and feet. Joint stiffness has gradually increased over time, particularly affecting small joints. Facial differences, including a round face, long eyelashes, a bulbous nasal tip, and anteverted nares, were observed as the patient grew. No episodic pain, systemic symptoms, or developmental regression have been reported. Developmental history and growth parameters are currently under review.\n\nFamily History\nNo known family members with short stature, skeletal dysplasia, or congenital anomalies. No consanguinity reported. The family history is otherwise non-contributory.\n\nPhysical Examination\nThe patient demonstrates proportionate short stature, short palms, and short feet. Musculoskeletal examination reveals joint stiffness and an internal notch of the femoral head. Craniofacial evaluation identifies a round face, long eyelashes, a bulbous nose, and anteverted nares. No abnormalities in cardiopulmonary or abdominal examinations were noted.\n\nSpecialty Assessments\nOrthopedic Assessment: Findings consistent with skeletal dysplasia, including hand and foot shortening and limited joint mobility. Hip evaluation indicates an internal notch of the femoral head, a feature reported in acromelic dysplasias.\n\nAncillary Investigation\nNo laboratory or imaging results are currently available. Radiographic evaluation is pending to assess characteristic features such as short tubular bones, delayed bone age, and cone-shaped epiphyses. Genetic testing for FBN1 mutations, particularly in exons encoding the TB5 domain, is recommended to support diagnostic clarification.\n\nGenetic Testing Report\nA targeted genomic analysis identified a heterozygous single-nucleotide variant in the FBN1 gene located on chromosome 15 (chr15:48463124 C>T). This variant corresponds to NM_000138.5:c.5182G>A, resulting in a missense substitution in the fibrillin-1 protein.", "disease": "Acromicric dysplasia", "orphacode": "ORPHA:969"}
